#include <stdio.h>
#include <math.h>

int main() {
    int experience[8][5] = {
        {1, 2, 3, 4, 5},
        {6, 7, 8, 9, 10},
        {11, 12, 13, 14, 15},
        {16, 17, 18, 19, 20},
        {21, 22, 23, 24, 25},
        {26, 27, 28, 29, 30},
        {31, 32, 33, 34, 35},
        {36, 37, 38, 39, 40}
    };
    
    int bonus[5] = {1, 5, 10, 15, 20};

    int itog[8] = {0, 0, 0, 0, 0, 0, 0, 0};
    int prohi[8] = {0, 0, 0, 0, 0, 0, 0, 0};

    for (int i = 0; i < 8; i++) {
        for (int j = 0; j < 5; j++) {
            if (experience[i][j] < 20) {
                break;
            }
            else { 
                itog[i] += experience[i][j] + bonus[j];
                prohi[i]++;
            }
        }
    }

    int max[2] = {0, 0};
    for (int i = 0; i < 5; i++) {
        if (itog[i] > max[0] && prohi[i] == 5) {
            max[0] = itog[i];
            max[1] = i + 1;
        }
    }

    printf("+--------------------------------------+\n");
    printf("| Таблица Результатов                  |\n");
    printf("|--------------------------------------|\n");
    printf("| Максимальный итог: %-4d ( Герой №%-2d) |\n", max[0], max[1]);
    printf("|--------------------------------------|\n");
    printf("| Итоговые значения по игрокам:        |\n");
    for (int i = 0; i < 8; i++) {
        printf("| Герой № %d, очки: %-19d |\n", i+1, itog[i]);
    }
    printf("+--------------------------------------+\n");

    getchar();
    return 0;
}
