#include <stdio.h>

int main() {
    int experience[8][5] = {
        {45, 60, 30, 80, 55},
        {70, 15, 90, 40, 65},
        {25, 35, 95, 20, 75},
        {50, 40, 10, 60, 85},
        {90, 85, 100, 70, 95},
        {20, 30, 25, 45, 35},
        {60, 55, 18, 75, 50},
        {80, 65, 90, 85, 100}
    };
    
    int bonus[5] = {1, 5, 10, 15, 20};

    int itog[8] = {0, 0, 0, 0, 0, 0, 0, 0};
    int prohi[8] = {0, 0, 0, 0, 0, 0, 0, 0};

    for (int i = 0; i < 8; i++) {
        for (int j = 0; j < 5; j++) {
            if (experience[i][j] < 20) {
                break;
            }
            else { 
                itog[i] += experience[i][j] + bonus[j];
                prohi[i]++;
            }
        }
    }

    int max[2] = {-1, 0};
    for (int i = 0; i < 8; i++) {
        if (itog[i] > max[0] && prohi[i] == 5) {
            max[0] = itog[i];
            max[1] = i + 1;
        }
    }

    printf("+--------------------------------------+\n");
    printf("| Таблица Результатов                  |\n");
    printf("|--------------------------------------|\n");
    if (max[1] != 0) {
        printf("| Максимальный итог: %-4d ( Герой №%-2d) |\n", max[0], max[1]);
    }
    else {
        printf("| Победитель не определён              |\n");
    }
    printf("|--------------------------------------|\n");
    printf("| Итоговые значения по игрокам:        |\n");
    for (int i = 0; i < 8; i++) {
        printf("| Герой № %d, очки: %-19d |\n", i+1, itog[i]);
    }
    printf("+--------------------------------------+\n");

    getchar();
    return 0;
}
